print("Введите числа:")
print("a=")
a=float(input())
print("b=")
b=float(input())
print("c=")
c=float(input())
if a==a//1 and b==b//1 and c==c//1:
    if b == 0:
        print("Действие \"Нахождение остатка от деления\" не имеет смысла")
    else:
        if a % b == c:
            print("Числа обладают свойством: a даёт остаток c при делении на b")
        else:
            print("Числа не обладают свойством: a даёт остаток c при делении на b")
else: print("Действие \"Нахождение остатка от деления\" не имеет смысла")
if a==0:
    print("Действие \"Нахождение решения линейного уравнения ax + b = 0\" не имеет смысла")
else:
    if c==-b/a:
        print("Числа обладают свойством: c является решением линейного уравнения ax + b = 0")
    else:
        print("Числа не обладают свойством: c является решением линейного уравнения ax + b = 0")