# Вам нужно сохранить у себя на компьютере  статью из Википедии, указанную в задании. Файл, естественно, должен быть в UTF-8.
# Программа должна читать этот файл и заменять в нём все формы слова A на соответствующие формы слова B (слова A и B тоже указаны в задании для Вашего варианта).
# То, что получится, она должна записывать в другой текстовый файл.
# Заменяться должны только формы этого слова. Т. е. если Вам нужно заменить слово "кит" на слово "кот", слово "китовый" на слово "котовый" заменяться не должно.
# При замене нужно пользоваться функцией re.sub. Если слово было написано с большой буквы, то и после замены оно должно быть написано с большой буквы.
# 3. статья "лингвистика", заменить "язык" на "шашлык";


import re


def text():
    f = open('text.txt', 'r', encoding='utf-8')
    s = f.read()
    return s


def change(s):
    s1 = re.sub('язык(а|у|ом|ами|е)?[^а-я]', 'шашлык\\1', s)
    s2 = re.sub('Язык(а|у|ом|ами|е)?[^а-я]', 'Шашлык\\1', s1)
    return s2


def main():
    txt = text()
    print(change(txt))


main()