# Для выполнения задания нужно открыть любую в меру длинную статью из Википедии. Например, эту: Михайловский замок. Текст статьи нужно скопировать в отдельный файл и сохранить на компьютере.

# 1 (5 баллов). Найти и распечатать на экране все упоминания имен вида "инициал + фамилия" (например: Я. Меттенлейтер).

# 2 (8 баллов). Найти в статье вообще все имена (инициалы + фамилия, например, В. И. Наливайко; имя + фамилия, например, Винченцо Бренна). При этом в найденное может попасть лишнее (например, Круглому Тронному), но не должно ничего теряться.

# 3 (10 баллов). Для каждого найденного в предыдущем пункте случая отделить имя (или инициалы) от фамилии, для каждой фамилии создать отдельную папку, а внутри неё для каждого сочетания "инициалы + фамилия" или "имя + фамилия" создать текстовый файл с предложением, в котором упоминается это вхождение.


