# Вам нужно написать программу, которая загадывает слова.
# Загадав существительное, программа показывает подсказку в виде распространённого словосочетания с этим существительным,
# в котором существительное заменено многоточием, и ждёт ответа пользователя, после чего сообщает, выиграл он или проиграл.
# Например, если загадано слово "снег", можно показать подсказку "белый ...".
# Словосочетание можно подсмотреть в корпусе: http://ruscorpora.ru/beta/search-ngrams_2.html или довериться интуиции.
# В задании обязательно использовать словарь. Программа должна уметь загадывать как минимум 5 разных слов (с разными подсказками).
# Кроме того, желательно, чтобы слова и подсказки хранились в отдельном csv-файле, который загружался бы при запуске программы.




# Пользователю даётся столько попыток угадать слово, сколько букв в подсказке;


def PrepText(m):
    f = open(m, 'r', encoding='utf-8')
    s = f.read().split()
    words = []
    for n in s:
        words.append(n.lower().strip())
    f.close
    return words


def dic(m):
    dict = {}
    for i in range(len(m) - 1):
        if i % 2 == 0:
            dict[m[i]] = m[i + 1]
    return dict


def guess(di):
    for k in (di):
        print('Угадайте слово по подсказке:' + ' ' + k + ' ...')
        for i in range(len(k)):
            m = input()
            if m != di[k]:
                if i == len(k) - 1:
                    print('Попытки исчерпаны. Вы не угадали.')
                    break
                else:
                    print('Неверно. Попробуйте снова.')
                    continue
            else:
                print('Вы угадали слово, поздравляем.')
                break
        break
    return


def main():
    guess(dic(PrepText('text.csv')))
    return


main()
